project_plan/flask-ci-cd-plan.org
This is a simple CI/CD project to showcase my skills in ....

It's aim is for someone to be able to download this repository and run it
himself to create a working CI/CD pipeline in AWS based on Jenkins
that deploys a container with a flask web app to AWS each time a
commit is made to the tracked flask app repository. 


* DONE Fork the simple Python Flask web application.
CLOSED: [2023-04-18 Tue 18:46]
