project_plan/flask-ci-cd-plan.md


<a id="org5f3ac9d"></a>

## Exploring tutor's choice of the app. Reading about Corey Schafer on his blog, <https://coreyms.com>

This app was committed as a whole, with several distinct stages. I'm
going to use the stages as basis of separate commits for testing of
the pipeline and in the beginning only commit the first stage.


<a id="org5ac3b48"></a>

## Download the repository contents with curl.

    curl -L
    http://github.com/CoreyMSchafer/code_snippets/archive/master.tar.gz |
    tar zxf -


<a id="orgc053cfa"></a>

## Created a new repository, copied contents of the first chapter from Flask<sub>Blog</sub> tutorial.

Flask Blog code found at [this address](https://github.com/CoreyMSchafer/code_snippets/tree/master/Python/Flask_Blog).
Copied .gitignore from the CI/CD repo, but added the name of directory
with the original Corey's repo files, so they wont all get committed
at once.


<a id="org4c362f4"></a>

# DONE Create a separate repository for Jenkins provisioning, installation, and configuration.


<a id="org5ecf9b9"></a>

# DONE Set up Jenkins part 1: setting up a VM on AWS using Terraform.


<a id="org7c741d0"></a>

## Create a data source that gets the AMI of the latest Alma Linux 9


<a id="org2631337"></a>

## Create a base main.tf file that is a copy from the Terraform Up and Running code. Also add an alternative version that was given as an example of Jenkins setup on AWS.


<a id="orgc47bfde"></a>

## Add definitions for basic VPC and subnet


<a id="org60b9994"></a>

## Modify the basic security group definition to allow incoming traffic on ports 22 (for SSH) and 8080 (Jenkins web app)


<a id="org3c9f4f3"></a>

## Move some values to variables to make code cleaner and reusable or usable by people who choose to use different AWS region


<a id="org6106b49"></a>

### Move the port values to a variable and use variables instead.


<a id="org4127cd0"></a>

### Move the EC2 instance type to a variable (eu-north-1 region requires usage of a non standard t3 type server)


<a id="org12a7bfe"></a>

### Move the region name to a variable.


<a id="org699109c"></a>

## Create a script to create and open/close LUKS container (which can hold the SSH key).


<a id="org681a3c7"></a>

## Write out pseudocode for a script that would execute the whole project.


<a id="orge4c1f08"></a>

## Put the initial steps (vault creation, SSH key generation and uploading and Jenkins VM spin up) into the playtrough script.


<a id="org2543b6c"></a>

### 1: Vault creation - done


<a id="org569e843"></a>

### 2: SSH key generation - done


<a id="org14b3f08"></a>

### 3: SSH key uploading & VM spin up - need to finish some things first:

1.  Find a way to make the EC2 instance accessible from the internet (can't access it now if I'm creating my own subnet)

2.  Find a way to pass the IP address of the EC2 instance to Ansible


<a id="orgbc32b99"></a>

## Had some issues with creating a VM accessible from the outside. Followed a blog article tutorial and succeeded, need to take what I learned there and put it in my Terraform code.

Following instructions in the [blog post](https://medium.com/geekculture/how-to-manage-public-and-private-subnets-in-aws-with-terraform-69c272003c81) for deploying a private and public subnet on AWS using Terraform.


<a id="orgf9e1ef0"></a>

### Planning:

I'll create this infrastructure copying the solution from the blog
word for word in a separate directory. After confirming that it works,
I'll note the differences between the working infrastructure and what
I had. Afterwards I'll use the notes to modify mine to comply with the
working one and hope it will be what's needed. From skimming the
document quickly, I guess that my problem was not adding the routing
table to the public subnet, but it might not be everything.


<a id="org393ef92"></a>

### DONE Create a file for VPC


<a id="orgc63a382"></a>

### DONE Create a file for Public Subnet


<a id="org46be271"></a>

### DONE Create a file for Internet Gateway


<a id="orgde2201c"></a>

### DONE Create a file for the Route Table for the Public Subnet


<a id="org6914c4d"></a>

### DONE Create a file for the Security Group


<a id="orge2bf1f5"></a>

### DONE Create a file for the Public EC2 Instance


<a id="org064b352"></a>

### DONE Create a variable file


<a id="orgae69e1d"></a>

### DONE Creating a NAT with an Elastic IP - what I'm not going to do.

1.  Create a file for the Public Subnet for NAT Gateway

2.  Create a file for Elastic IP (EIP)

3.  Create a file for the NAT Gateway

4.  Create a file for the Route Table for the NAT Gateway

5.  Create a file for the Private Subnet

6.  Create a file for the Route Table for the Private Subnet

7.  Create a file for the Private EC2 Instance


<a id="org63088a2"></a>

### DONE Run and see if it works

1.  Strange error, looked like one line was "disappeared" in Emacs.

    Terraform signaled an error of redefining type. This type of error
    happens if we have a double definition of something that can only be
    defined once.
    
    I didn't see anything wrong in the file. Turning on the 'linum-mode'
    in Emacs showed, that there was one line that "disappeared". Line 4
    was right after the second line. I didn't investigate, just went to
    the end of line 2 and held delete until I deleted the phantom line.

2.  Had to add the ssh key uploading code.

    I thought I can just link the name of the key uploaded by the flask
    terraform code. It didn't work, maybe because 'terraform destroy'
    destroys also SSH keys that are defined in the project. I just copied
    what had to be copied and got the ssh-key name using terraform
    variable substitution instead of the name I could get from AWS. Thanks
    to writing out all the code I feel like I'm getting the hang of
    Terraform. At least the hang of how things tend to be named and how to
    get id's or inside-secret-names of things, using variables.


<a id="orgbb3d915"></a>

### DONE Find the differences

Differences were the routing table and routing table association.


<a id="org501d9bf"></a>

### DONE Add them to flask-ci-cd Terraform code.

Added all networking infrastructure code to main.tf.


<a id="org4151391"></a>

## TODO <a id="org3edc3ca"></a>


<a id="org9d65e05"></a>

### Temporarily solved by having Terraform update Ansible's inventory file on each execution of 'terraform apply'.


<a id="org3767742"></a>

### We can keep some kind of state file there so that Terraform, Ansible and later Jenkins can communicate with each other or find out details on how to run the project.


<a id="org1dc0f15"></a>

### File will be in bash, so that it can be sourced to read all the variables into memory.


<a id="org80b3a63"></a>

### To protect the secrets, a trap will be added to playtrough.sh script so that on script exit, the vault can be locked again.


<a id="orgb349e30"></a>

### Since vault starts as empty, we need to check if it(file with secrets)'s there and generate the file if it doesn't exist yet.


<a id="org26c1a65"></a>

# DONE Set up Jenkins part 2: install Jenkins using Ansible.


<a id="orgd7e44ed"></a>

## DONE Find good instructions on how to install Jenkins in it's documentation or from some other credible source


<a id="org482e88b"></a>

### <https://www.jenkins.io/doc/book/installing/linux/#fedora>


<a id="orgd226b62"></a>

## DONE Create a Vagrant VM for local tests/development of the Jenkins playbook


<a id="org0b871d5"></a>

### Reinstalled Vagrant because of libvirt plugin issues

I've made the mistake of assuming that libvirt-devel package is going
to automatically pull libvirt. It's possible that reinstallation
wasn't necessary.


<a id="orgdbe60f1"></a>

### Installed & enabled libvirt and vagrant-libvirt plugin


<a id="orgdc8c04f"></a>

### Downloaded Alma Linux 9 vagrant box


<a id="org2c9e2d0"></a>

### Modified the default Vagrantfile based on previous projects (hostname, IP address, RAM)


<a id="org5cd24ad"></a>

### Start an Apache server on the Vagrant machine to make sure everything works

I could see the test webpage after installing Apache and enabling it
in firewall.


<a id="org53f9af1"></a>

## DONE Create a bash script or pseudocode script with the instructions listed in order.
