project_plan/flask-ci-cd-plan.org
*** Here are instructions from the Jenkins docs for installation on Fedora.
#+BEGIN_SRC bash
sudo wget -O /etc/yum.repos.d/jenkins.repo \
    https://pkg.jenkins.io/redhat-stable/jenkins.repo
sudo rpm --import https://pkg.jenkins.io/redhat-stable/jenkins.io-2023.key
sudo dnf upgrade
# Add required dependencies for the jenkins package
sudo dnf install java-17-openjdk
sudo dnf install jenkins
sudo systemctl daemon-reload
#+END_SRC
Not sure if it enables and starts the Jenkins service.
*** Here is a script to configure firewalld (RedHat family firewall service), also from Jenkins docs

#+BEGIN_SRC bash
YOURPORT=8080
PERM="--permanent"
SERV="$PERM --service=jenkins"

firewall-cmd $PERM --new-service=jenkins
firewall-cmd $SERV --set-short="Jenkins ports"
firewall-cmd $SERV --set-description="Jenkins port exceptions"
firewall-cmd $SERV --add-port=$YOURPORT/tcp
firewall-cmd $PERM --add-service=jenkins
firewall-cmd --zone=public --add-service=http --permanent
firewall-cmd --reload
#+END_SRC

** DONE Test if these scripts/instructions work on a local Vagrant VM
CLOSED: [2023-08-02 Wed 13:54]
*** All this works and installs 
Jenkins, tho the Jenkins service had to be explicitly enabled/started
Firewall configuration might be even simpler - the Jenkins service is
most likely already defined in firewalld services.
** DONE Create a playbook based on the instructions
CLOSED: [2023-08-03 Thu 21:25]
** DONE Debug the playbook until it deploys a working Jenkins server
CLOSED: [2023-08-04 Fri 10:36]
*** There were issues with nearly each task in this short playbook. The way Ansible tasks are defined is very similar to bash, but it's not identical. I've also made a YAML newbie mistake of supplying a one-element list instead of a string.
Notes from troubleshooting/debugging can be found in the project
journal under Fri Aug 4 10:45:00 AM CEST 2023
* DONE Part 3: Create a Jenkinsfile in the Flask web application repository
CLOSED: [2023-09-24 Sun 14:12]
** DONE Improve the python-flask-cicd-code repository so that it can output a docker image
CLOSED: [2023-09-18 Mon 15:34]
*** Can't copy all files inside the repo onto the docker image, but found a solution - .dockerignore
*** Some issues with dependencies resolved by unpinning the dependencies
**** More issues kept coming up. I can deploy this fancy blog in a later iteration. For now a simple flask hello world will suffice.
*** DONE Writing a simple Flask Hello World with help of ChatGPT
CLOSED: [2023-09-18 Mon 15:34]
Build a docker image with it and run it to make sure that it works,
and it does.
** DONE Test, debug and make sure it works when run manually
CLOSED: [2023-09-18 Mon 15:35]
** DONE Manually upload the docker image either to AWS or Dockerhub
CLOSED: [2023-09-18 Mon 17:59]
** DONE Describe the process in a declarative Jenkinsfile, automating the process of docker image creation in a manually setup Jenkins
CLOSED: [2023-09-20 Wed 19:18]
For this followed a tutorial found in Jenkins docs.
*** DONE First prepare the Jenkins server to use docker
CLOSED: [2023-09-20 Wed 19:18]
*** DONE Write a pipeline file (Jenkinsfile) based on web tutorials
CLOSED: [2023-09-20 Wed 19:18]
** DONE Update Ansible playbook knowing what was missing from the server:
CLOSED: [2023-09-21 Thu 18:22]
*** DONE Summary: How do I need to modify my Ansible playbook?
CLOSED: [2023-09-21 Thu 18:22]

*** DONE Install repo: https://download.docker.com/linux/centos/docker-ce.repo
CLOSED: [2023-09-21 Thu 18:22]

*** DONE Remove packages:
CLOSED: [2023-09-21 Thu 18:22]
podman
buildah

*** DONE Install packages:
CLOSED: [2023-09-21 Thu 18:22]
bash-completion (for debugging and usability)
docker-ce docker-ce-cli containerd.io
git

*** DONE Add jenkins user to docker group, !! jenkins service shouldn't be started before jenkins is added to the docker group !!
CLOSED: [2023-09-21 Thu 18:22]

*** DONE Start and enable the docker.service
CLOSED: [2023-09-21 Thu 18:22]

* TODO Part 4: Deploy the Flask web application to ECS Fargate
** DONE Choose a deployment method: Decided to use AWS ECS with Fargate which is a very straightforward method of deploying a docker container to the cloud
CLOSED: [2023-09-20 Wed 10:08]
** DONE Read up documentation and tutorials:
CLOSED: [2023-09-24 Sun 14:05]
*** AWS Docs: Building a serverless Jenkins environment on AWS Fargate https://aws.amazon.com/blogs/devops/building-a-serverless-jenkins-environment-on-aws-fargate/
This is not exactly my use case, but it will be useful. It talks about
deploying Jenkins to ECS Fargate. But it includes info on temporary
credentials for 'AWS ECS Cluster access role' and 'Deployment role'. 
*** Summary:
I need to start with a simple example of deploying a hello world to
ECS Fargate, then do it with Terraform (or maybe even start with
Terraform), then do it with Terraform from inside a Jenkinsfile and
lastly, do it from a Jenkinsfile with safely configured permissions
and credentials, so it can safely sit for a moment in the cloud.
** DONE Deploy a hello-world to ECS Fargate without Terraform
CLOSED: [2023-09-26 Tue 19:51]
https://docs.aws.amazon.com/AmazonECS/latest/developerguide/getting-started-aws-copilot-cli.html
This is a simplified deployment using AWS Copilot which is a
simplified and more user friendly alternative to AWS CLI.
*** DONE Fulfill requirements
CLOSED: [2023-09-26 Tue 18:52]
Had to install Copilot and AWS CLI and set up tab-completions.

** DONE Read enough ECS docs to know how to deploy to cloud using AWS CLI
CLOSED: [2023-09-29 Fri 21:48]
** DONE Upload Docker image to ECR
CLOSED: [2024-06-19 Wed 10:31]
*** DONE Find out how to push to ECR with Docker/AWS CLI
CLOSED: [2023-10-14 Sat 15:50]
https://stackoverflow.com/a/68668097
This assumes we already have an ECR repo.
*** DONE Test the code on a local machine. Part 1: Create an ECR repo with Terraform
CLOSED: [2023-10-15 Sun 13:12]
Looks like we need to create the repo first. It's more straightforward
to use AWS CLI for this.
Need to remember that a local command assumes the default region from
the profile. A proper way would be to define the region explicitly in
the 'aws' command.

By mistake (I had 2 weeks break with the project) I've
started working on how to do the Terraform part of CI/CD. After
research, I've decided not to delay project further by learning on how
to use modules and just create separate Terraform projects in it's own
directories.

Since the hardest part of programming is done already (researching
available options, choosing the right alternatives, planning on how to
do things) and all that's left to crate an ECR repo with Terraform is
coding the solution, I'll skip the step of creating an ECR repo with
aws-cli.

Using the Terraform files from the Jenkins deployment as templates.
*** DONE Test the code on a local machine. Part 2: Push the image to the repo with Docker
CLOSED: [2023-10-22 Sun 12:04]
It worked, with some small issues.
*** DONE Note that the playbook will have to be updated (with AWS CLI and jq installation)
CLOSED: [2024-05-10 Fri 10:30]
**** DONE Add 'jq' to the list of installed packages
CLOSED: [2023-11-07 Tue 13:33]
**** DONE Make the playbook install AWS CLI if it's not installed
CLOSED: [2024-04-01 Mon 15:36]
***** Steps to install AWS CLI (from AWS docs):
***** Download the installation files
***** Extract them
***** Run the installation script with elevated privileges
***** Verify the installation
**** DONE Debug the playbook so that it works on both a fresh machine and on a machine where it was already installed (the playbook is indempotent)
CLOSED: [2024-05-10 Fri 10:30]
There were issues with starting Jenkins after dropping the plugins in. Looks like it's not as easy as copying the files onto the server. Need to solve the problem in a different way - using Jenkins command line interface.
