project_plan/flask-ci-cd-plan.md


<a id="orgd34d3d8"></a>

### Here are instructions from the Jenkins docs for installation on Fedora.

    sudo wget -O /etc/yum.repos.d/jenkins.repo \
        https://pkg.jenkins.io/redhat-stable/jenkins.repo
    sudo rpm --import https://pkg.jenkins.io/redhat-stable/jenkins.io-2023.key
    sudo dnf upgrade
    # Add required dependencies for the jenkins package
    sudo dnf install java-17-openjdk
    sudo dnf install jenkins
    sudo systemctl daemon-reload

Not sure if it enables and starts the Jenkins service.


<a id="org52d74fd"></a>

### Here is a script to configure firewalld (RedHat family firewall service), also from Jenkins docs

    YOURPORT=8080
    PERM="--permanent"
    SERV="$PERM --service=jenkins"
    
    firewall-cmd $PERM --new-service=jenkins
    firewall-cmd $SERV --set-short="Jenkins ports"
    firewall-cmd $SERV --set-description="Jenkins port exceptions"
    firewall-cmd $SERV --add-port=$YOURPORT/tcp
    firewall-cmd $PERM --add-service=jenkins
    firewall-cmd --zone=public --add-service=http --permanent
    firewall-cmd --reload


<a id="org375a064"></a>

## DONE Test if these scripts/instructions work on a local Vagrant VM


<a id="orgd043313"></a>

### All this works and installs

Jenkins, tho the Jenkins service had to be explicitly enabled/started
Firewall configuration might be even simpler - the Jenkins service is
most likely already defined in firewalld services.


<a id="org73db5e7"></a>

## DONE Create a playbook based on the instructions


<a id="org9c48493"></a>

## DONE Debug the playbook until it deploys a working Jenkins server


<a id="org31591aa"></a>

### There were issues with nearly each task in this short playbook. The way Ansible tasks are defined is very similar to bash, but it's not identical. I've also made a YAML newbie mistake of supplying a one-element list instead of a string.

Notes from troubleshooting/debugging can be found in the project
journal under Fri Aug 4 10:45:00 AM CEST 2023


<a id="org5879659"></a>

# DONE Part 3: Create a Jenkinsfile in the Flask web application repository


<a id="org9a52695"></a>

## DONE Improve the python-flask-cicd-code repository so that it can output a docker image


<a id="org9f4f089"></a>

### Can't copy all files inside the repo onto the docker image, but found a solution - .dockerignore


<a id="org9fbb656"></a>

### Some issues with dependencies resolved by unpinning the dependencies

1.  More issues kept coming up. I can deploy this fancy blog in a later iteration. For now a simple flask hello world will suffice.


<a id="orgf3d73e5"></a>

### DONE Writing a simple Flask Hello World with help of ChatGPT

Build a docker image with it and run it to make sure that it works,
and it does.


<a id="org46bfa37"></a>

## DONE Test, debug and make sure it works when run manually


<a id="org0e13e0d"></a>

## DONE Manually upload the docker image either to AWS or Dockerhub


<a id="orgad29a92"></a>

## DONE Describe the process in a declarative Jenkinsfile, automating the process of docker image creation in a manually setup Jenkins

For this followed a tutorial found in Jenkins docs.


<a id="org889e448"></a>

### DONE First prepare the Jenkins server to use docker


<a id="orgb4c9290"></a>

### DONE Write a pipeline file (Jenkinsfile) based on web tutorials


<a id="org7100e6b"></a>

## DONE Update Ansible playbook knowing what was missing from the server:


<a id="org67a8b20"></a>

### DONE Summary: How do I need to modify my Ansible playbook?


<a id="orgab0f821"></a>

### DONE Install repo: <https://download.docker.com/linux/centos/docker-ce.repo>


<a id="org5ecd769"></a>

### DONE Remove packages:

podman
buildah


<a id="org88f4978"></a>

### DONE Install packages:

bash-completion (for debugging and usability)
docker-ce docker-ce-cli containerd.io
git


<a id="org182597a"></a>

### DONE Add jenkins user to docker group, !! jenkins service shouldn't be started before jenkins is added to the docker group !!


<a id="org74a0e75"></a>

### DONE Start and enable the docker.service


<a id="orge216675"></a>

# TODO Part 4: Deploy the Flask web application to ECS Fargate


<a id="org91038b4"></a>

## DONE Choose a deployment method: Decided to use AWS ECS with Fargate which is a very straightforward method of deploying a docker container to the cloud


<a id="org160c9cf"></a>

## DONE Read up documentation and tutorials:


<a id="org31f2642"></a>

### AWS Docs: Building a serverless Jenkins environment on AWS Fargate <https://aws.amazon.com/blogs/devops/building-a-serverless-jenkins-environment-on-aws-fargate/>

This is not exactly my use case, but it will be useful. It talks about
deploying Jenkins to ECS Fargate. But it includes info on temporary
credentials for 'AWS ECS Cluster access role' and 'Deployment role'. 


<a id="orgd209930"></a>

### Summary:

I need to start with a simple example of deploying a hello world to
ECS Fargate, then do it with Terraform (or maybe even start with
Terraform), then do it with Terraform from inside a Jenkinsfile and
lastly, do it from a Jenkinsfile with safely configured permissions
and credentials, so it can safely sit for a moment in the cloud.


<a id="org1d7c402"></a>

## DONE Deploy a hello-world to ECS Fargate without Terraform

<https://docs.aws.amazon.com/AmazonECS/latest/developerguide/getting-started-aws-copilot-cli.html>
This is a simplified deployment using AWS Copilot which is a
simplified and more user friendly alternative to AWS CLI.


<a id="orgac5334f"></a>

### DONE Fulfill requirements

Had to install Copilot and AWS CLI and set up tab-completions.


<a id="org5facc8c"></a>

## DONE Read enough ECS docs to know how to deploy to cloud using AWS CLI


<a id="orgfdd63a2"></a>

## TODO Upload Docker image to ECR


<a id="org7d38c53"></a>

### DONE Find out how to push to ECR with Docker/AWS CLI

<https://stackoverflow.com/a/68668097>
This assumes we already have an ECR repo.


<a id="org8712e35"></a>

### DONE Test the code on a local machine. Part 1: Create an ECR repo with Terraform

Looks like we need to create the repo first. It's more straightforward
to use AWS CLI for this.
Need to remember that a local command assumes the default region from
the profile. A proper way would be to define the region explicitly in
the 'aws' command.

By mistake (I had 2 weeks break with the project) I've
started working on how to do the Terraform part of CI/CD. After
research, I've decided not to delay project further by learning on how
to use modules and just create separate Terraform projects in it's own
directories.

Since the hardest part of programming is done already (researching
available options, choosing the right alternatives, planning on how to
do things) and all that's left to crate an ECR repo with Terraform is
coding the solution, I'll skip the step of creating an ECR repo with
aws-cli.

Using the Terraform files from the Jenkins deployment as templates.


<a id="orgf6fb730"></a>

### DONE Test the code on a local machine. Part 2: Push the image to the repo with Docker

It worked, with some small issues.


<a id="org60c6835"></a>

### DONE Note that the playbook will have to be updated (with AWS CLI and jq installation)

1.  DONE Add 'jq' to the list of installed packages

2.  DONE Make the playbook install AWS CLI if it's not installed

    1.  Steps to install AWS CLI (from AWS docs):
    
    2.  Download the installation files
    
    3.  Extract them
    
    4.  Run the installation script with elevated privileges
    
    5.  Verify the installation

3.  DONE Debug the playbook so that it works on both a fresh machine and on a machine where it was already installed (the playbook is indempotent)

    There were issues with starting Jenkins after dropping the plugins in. Looks like it's not as easy as copying the files onto the server. Need to solve the problem in a different way - using Jenkins command line interface.
