project_plan/flask-ci-cd-plan.org
*** DONE Playbook should also install Terraform
CLOSED: [2024-06-02 Sun 19:49]
Instructions on [[https://developer.hashicorp.com/terraform/tutorials/aws-get-started/install-cli][Hashicorp's website]] for RHEL family Linux systems is pretty straightforward. It is also almost identical to how we install docker - add a repo and then install a package from that repo.
**** Had some issues with adding the hashicorp repo with ansible, but found out the reason through comparison with regular bash instructions for how to add the repo
**** While working on the above I've introduced another bug into the playbook, but successfully resolved it too.
When dividing long URLs (or strings in general) over two lines, you
need to remember to place a backslash at the end of the first (and
really each) line, if you want them to be later coalesced into one
string without any newlines.

*** DONE Test the code again, on a newly provisioned machine
CLOSED: [2024-06-19 Wed 10:30]
**** DONE Setting up image repository
CLOSED: [2024-06-12 Wed 11:02]
Tested it on my development machine. Didn't want to put my secrets on
working servers until I find a secure way to handle them. Also, AWS
EC2 instances don't need the secrets, as they get authorized to deploy
into cloud with AIM policies. AIM - Amazon Identity Management.
**** DONE Running Jenkins pipeline to check if it can upload the image.
CLOSED: [2024-06-12 Wed 19:12]
There was no Jenkins pipeline saved that would upload the image.
**** DONE Modify playbook to allow usage of Bitwarden and project's /bin scripts on Jenkins server
CLOSED: [2024-06-15 Sat 16:01]
Modified the playbook to do a sparse checkout on the project's repo
and copy downloaded scripts into /usr/local/bin so they can be easily
accessed. This solves the credentials problem, as we just run a script
that copies AWS credentials into environment variables, pulling them
via bitwarden-cli.
**** DONE Manually upload the image from docker, following the tutorial
CLOSED: [2024-06-19 Wed 10:28]
Had to manually create the ECR repo again, but it was just a matter of
cloning the app code repo and doing a `terraform init` and `terraform
apply`. Had to add vagrant user to the docker group.
Had to modify the repo name in the push-image-jenkinsless.sh script.
The name used to distinguish the repo differs between Terraform and
Docker.

** TODO Write Terraform code that deploys to the cloud, not worrying about secrets and permissions at first
Following a [[https://earthly.dev/blog/deploy-dockcontainers-to-awsecs-using-terraform/][tutorial found on earthly.dev]]
*** DONE Test if container works locally
CLOSED: [2024-06-19 Wed 16:54]
*** TODO Write Terraform code deploying container to ECS
**** DONE Read on ECS/Fargate deployments with Terraform
CLOSED: [2024-06-30 Sun 22:14]
**** TODO Refactor Jenkin's side Terraform Networking code to make it viable for reuse on the ECS side.
**** Create an ECS Cluster with Terraform
**** Write a Task Definition


** Put the Terraform code in a Jenkinsfile, maybe create few more steps, so that it's easier to see where exactly is the pipeline execution. Also use more descriptive names for steps, like 'Build Docker Image' instead of just 'Build'.
** Test, debug and make sure it works with a manually set up Jenkins server
** Find out what needs to be done to use AWS permissions and secret store to give the least permissions required to have Jenkins auto deploy the container to ECS Fargate
** Automate the deployment of the app when a new version of Dockerfile appears
** Test, debug and make sure it works
* Part 5: Configure Jenkins using JCasC
** DONE Find some good sources on Jenkins as Code
   CLOSED: [2023-09-05 Tue 19:52]
*** Found both in Unix/Linux SysAdmin's Handbook (ULSAH):
**** jenkins pipeline as code
https://devopscube.com/jenkins-pipeline-as-code/

https://www.jenkins.io/doc/book/pipeline-as-code/

Looks like the Pipeline as Code is a concept of creating a project
related Jenkins workflow, called a pipeline, defined in
code. Alternative would be to click it out in GUI, but having it in
code along with the project is more tidy. It's super popular.
**** jenkins configuration as code
Is a not-so-popular way to configure a Jenkins server, which then
needs another Pipeline as Code configuration to run jobs. It's not
that popular, but it's the way to go for an automated deployment.
** TODO Manually configure Jenkins
** (Mistake - can't install plugins this way) Update the Ansible playbook for Jenkins installation to include the JCasC plugin
*** It wasn't easy because installing a plugin automatically on a new Jenkins installation can be challenging.
*** It seems that the most straightforward method would be to download the JCasC plugin on the Ansible host and then have Ansible push it to the server once it's up.
*** Ansible's 'wait_for' module waits for a port to open when an application starts up.
*** Got the JCasC plugin and it's dependencies packed neatly inside a .tgz file in the /jenkins_config directory
** Install a Jenkins plugin from a command line (without Ansible)
** Update playbook to install the JCasC plugin with Jenkins CLI
** Export the configuration in the JCasC format and create a new JCasC configuration based on that export
** Modify the Ansible playbook to place the configuration file on the Jenkins server
** Test, debug and make sure it works
* Part 6: Fully automate whole Jenkins deployment, configuration and pipeline setup using the 'playthrough.sh'
* TODO's (non mission-critical):
** Terraform
*** In Jenkins TF code - move variables into object and local variables
**** local variables
Not yet sure what should go there. But stuff like the port 0 or
protocol -1 or 0.0.0.0/0 CIDR block?
**** object variables
Make one object variable for VPC and one for Subnet and maybe one for
routing? Or maybe one big for networking? That could be too much.
** Create a secret's file in the vault, as described [[Create a file with secrets in the vault][here]] in part 1 of the project.
** vault_management.sh (low priority, because using Hashicorp's Vault will make this script obsolete):
*** Vault management script could detect if container is already created/closed/open and not report an error if container state is already as requested.
*** Add an option to destroy the existing vault.
** playthrough.sh
*** If the variables in the vault are not set, interview the user about required project details at the beginning of the script.
*** DONE Both sub points can be achieved checking for presence of a dotfile.
CLOSED: [2023-06-15 Thu 13:50]
**** Test if script is run in the project's root directory
**** Test if the vault is already accessible
*** DONE Get password from a file or source other than user's input.
CLOSED: [2023-06-13 Tue 12:05]
If an environment variable with password is already defined,
playthrough.sh will not ask for the password.

*** Mention the opt-in to the Alma Linux AMI in playthrough.sh
 Error: creating EC2 Instance: OptInRequired: In order to use this AWS Marketplace product you need to accept terms and subscribe. To do so please visit https://aws.amazon.com/marketplace/pp?sku=3kukoxmnoighcsbjd0u4nq9ds
│       status code: 401, request id:
c915e28b-9e1e-4199-9e1c-a5e027333e9e
**** Maybe it will be enough to warn the user? Would be cool to somehow force this subscription as one of the steps in the playthrough.sh. Maybe even test for it.

** Ansible (Jenkins server configuration):
*** Check aws binary version to avoid reinstalling the same version
*** Refactor /bin downloading task in the playbook to not say "changed" on each run
The task doesn't properly recognize when changes were made. Journal
entry from Sat Jun 15 contains a modification suggested by ChatGPT.

** DONE Making the project more presentable (on GitHub) - emacs-org to markdown export
CLOSED: [2024-06-20 Thu 14:30]
Plan is to add a git hook that will export project docs from .org to
markdown and then stage the new .md file in the commit. This file can
than be linked to from the project's README.

Looks like I haven't created a project's README yet.
