project_plan/flask-ci-cd-plan.md


<a id="org4d20bf9"></a>

### DONE Playbook should also install Terraform

Instructions on [Hashicorp's website](https://developer.hashicorp.com/terraform/tutorials/aws-get-started/install-cli) for RHEL family Linux systems is pretty straightforward. It is also almost identical to how we install docker - add a repo and then install a package from that repo.

1.  Had some issues with adding the hashicorp repo with ansible, but found out the reason trough comparisition with regular bash instructions

2.  While working on the above I've introduced another bug into the playbook, but successfully resolved it too.

    When dividing long URLs (or strings in general) over two lines, you
    need to remember to place a backslash at the end of the first (and
    really each) line, if you want them to be later coalesced into one
    string without any newlines.


<a id="org6f5e534"></a>

### TODO Test the code again, on a newly provisioned machine

1.  DONE Setting up image repository

    Tested it on my development machine. Didn't want to put my secrets on
    working servers until I find a secure way to handle them. Also, AWS
    EC2 instances don't need the secrets, as they get authorized to deploy
    into cloud with AIM policies. AIM - Amazon Identity Management.

2.  DONE Running Jenkins pipeline to check if it can upload the image.

    There was no Jenkins pipeline saved that would upload the image.

3.  DONE Modify playbook to allow usage of Bitwarden and project's /bin scripts on Jenkins server

    Modified the playbook to do a sparse checkout on the project's repo
    and copy downloaded scripts into /usr/local/bin so they can be easily
    accessed. This solves the credentials problem, as we just run a script
    that copies AWS credentials into environment variables, pulling them
    via bitwarden-cli.

4.  TODO Manually upload the image from docker, following the tutorial


<a id="orge15339a"></a>

## Write Terraform code that deploys to the cloud, not worrying about secrets and permissions at first


<a id="org77ae45b"></a>

### Write a Task Definition


<a id="org48654b4"></a>

### Read on ECS module for Terraform


<a id="orgb4f9c55"></a>

### Write Terraform code deploying container to ECS


<a id="org673f907"></a>

## Put the Terraform code in a Jenkinsfile, maybe create few more steps, so that it's easier to see where exactly is the pipeline execution. Also use more descriptive names for steps, like 'Build Docker Image' instead of just 'Build'.


<a id="org4af9ce7"></a>

## Test, debug and make sure it works with a manually set up Jenkins server


<a id="org35b222d"></a>

## Find out what needs to be done to use AWS permissions and secret store to give the least permissions required to have Jenkins auto deploy the container to ECS Fargate


<a id="org89e001a"></a>

## Automate the deployment of the app when a new version of Dockerfile appears


<a id="orgb82f50e"></a>

## Test, debug and make sure it works


<a id="org04ad8a8"></a>

# Part 5: Configure Jenkins using JCasC


<a id="org8bbb0cc"></a>

## DONE Find some good sources on Jenkins as Code


<a id="orgd83d0e4"></a>

### Found both in Unix/Linux SysAdmin's Handbook (ULSAH):

1.  jenkins pipeline as code

    <https://devopscube.com/jenkins-pipeline-as-code/>
    
    <https://www.jenkins.io/doc/book/pipeline-as-code/>
    
    Looks like the Pipeline as Code is a concept of creating a project
    related Jenkins workflow, called a pipeline, defined in
    code. Alternative would be to click it out in GUI, but having it in
    code along with the project is more tidy. It's super popular.

2.  jenkins configuration as code

    Is a not-so-popular way to configure a Jenkins server, which then
    needs another Pipeline as Code configuration to run jobs. It's not
    that popular, but it's the way to go for an automated deployment.


<a id="org429b16d"></a>

## TODO Manually configure Jenkins


<a id="org3a8d405"></a>

## (Mistake - can't install plugins this way) Update the Ansible playbook for Jenkins installation to include the JCasC plugin


<a id="org028aa9b"></a>

### It wasn't easy because installing a plugin automatically on a new Jenkins installation can be challenging.


<a id="orgb3dbd4e"></a>

### It seems that the most straightforward method would be to download the JCasC plugin on the Ansible host and then have Ansible push it to the server once it's up.


<a id="orgbd76c3a"></a>

### Ansible's 'wait<sub>for</sub>' module waits for a port to open when an application starts up.


<a id="org5305607"></a>

### Got the JCasC plugin and it's dependencies packed neatly inside a .tgz file in the /jenkins<sub>config</sub> directory


<a id="org4f80bdc"></a>

## Install a Jenkins plugin from a command line (without Ansible)


<a id="orge84429a"></a>

## Update playbook to install the JCasC plugin with Jenkins CLI


<a id="org175bbbe"></a>

## Export the configuration in the JCasC format and create a new JCasC configuration based on that export


<a id="orgaba63b9"></a>

## Modify the Ansible playbook to place the configuration file on the Jenkins server


<a id="org20989f5"></a>

## Test, debug and make sure it works


<a id="orgb852f28"></a>

# Part 6: Fully automate whole Jenkins deployment, configuration and pipeline setup using the 'playtrough.sh'


<a id="org4b2f26b"></a>

# TODO's (non mission-critical):


<a id="org719cf5d"></a>

## Create a secret's file in the vault, as described [here](#org3edc3ca) in part 1 of the project.


<a id="org1b06d87"></a>

## vault<sub>management.sh</sub> (low priority, because using Hashicorp's Vault will make this script obsolete):


<a id="org3585f82"></a>

### Vault management script could detect if container is already created/closed/open and not report an error if container state is already as requested.


<a id="org995f056"></a>

### Add an option to destroy the existing vault.


<a id="orgca50670"></a>

## playtrough.sh


<a id="org7fec6c1"></a>

### If the variables in the vault are not set, interview the user about required project details at the beginning of the script.


<a id="org5892382"></a>

### DONE Both sub points can be achieved checking for presence of a dotfile.

1.  Test if script is run in the project's root directory

2.  Test if the vault is already accessible


<a id="orgd8fd8ef"></a>

### DONE Get password from a file or source other than user's input.

If an environment variable with password is already defined,
playtrough.sh will not ask for the password.


<a id="orgad65387"></a>

### Mention the opt-in to the Alma Linux AMI in playtrough.sh

 Error: creating EC2 Instance: OptInRequired: In order to use this AWS Marketplace product you need to accept terms and subscribe. To do so please visit <https://aws.amazon.com/marketplace/pp?sku=3kukoxmnoighcsbjd0u4nq9ds>
│       status code: 401, request id:
c915e28b-9e1e-4199-9e1c-a5e027333e9e

1.  Maybe it will be enough to warn the user? Would be cool to somehow force this subscription as one of the steps in the playtrough.sh. Maybe even test for it.


<a id="orgc5c138c"></a>

## Ansible (Jenkins server configuration):


<a id="org040d5bd"></a>

### Check aws binary version to avoid reinstalling the same version


<a id="org8598808"></a>

### Refactor /bin downloading task in the playbook to not say "changed" on each run

The task doesn't properly recognize when changes were made. Journal
entry from Sat Jun 15 contains a modification suggested by ChatGPT.


<a id="org0d9ed8e"></a>

## TODO Making the project more presentable (on GitHub) - emacs-org to markdown export

Plan is to add a git hook that will export project docs from .org to
markdown and then stage the new .md file in the commit. This file can
than be linked to from the project's README.

Looks like I haven't created a project's README yet.
