project_plan/flask-ci-cd-plan.org
*** DONE Create a project's README
CLOSED: [2024-06-17 Mon 20:39]
Generated an initial version with ChatGPT. Will go over it a few times
to adjust it better to the project.
**** DONE Finished refactoring the README
CLOSED: [2024-06-17 Mon 20:40]
Thanks to that amazing template the project is now very well described
inside the README.
**** DONE Link to this README from python-flask-cidcd-code's README's
CLOSED: [2024-06-17 Mon 20:55]
We want somebody accidentally opening the code repo first to easily
find the main README. This way the README in the code repo can remain
simple.
*** DONE Quick-fix - manually generate a .md and link to it in README
CLOSED: [2024-06-17 Mon 20:55]
*** DONE Find a way to export .org to .md headlessly
CLOSED: [2024-06-20 Thu 14:24]
Used a headless Emacs instance, with instructions passed as arguments.
*** DONE Decide where exactly to attach the hook
CLOSED: [2024-06-20 Thu 14:24]
Used pre-commit hook, because there are no stage hooks.
*** DONE Add the hook
CLOSED: [2024-06-20 Thu 14:25]
Modified the existing pre-commit hook. Copied the hook to a directory
tracked by git, because I think this is a nice piece of work and is
worth preserving.
*** DONE Add links to auto-generated .md files in the project README
CLOSED: [2024-06-20 Thu 14:29]
Links were added when I coupled the readme with the manually generated
.md files.
*** DONE Think of edge cases, tidy things up
CLOSED: [2024-06-20 Thu 14:29]
It's not going to work with files with a different extension than
.org, but for now this is good enough.
* Mistakes:
** Terraform:
*** When testing Terraform configuration, running only Terraform Apply to test if it "compiles" - need to also test the IP address of the server
At some point I've introduced an error into my code, because I only
run `terraform destroy` and `terraform apply`. Without testing the
access to the server that was being set up.



*** Encapsulated a variable reference in double quotes, making it a literal string (effectively) turning off the reference mechanism.
#+BEGIN_SRC terraform
  provider "aws" {
    region = var.aws_region # Correct
    # region = "var.aws_region" # Incorrect
  }
#+END_SRC
** Using 'firewall-cmd' command without the '--permanent' option
It doesn't work.
** Ansible
*** Defining variables for a group in Ansible's hosts.ini outside [GROUPNAME:vars] subsection (forgetting the ':vars' modificator)
I used just the [GROUPNAME], instead of this:
[aws:vars]
#ansible_user=ec2-user
ansible_user=vagrant
ansible_ssh_private_key_file="../vault/id_25519_aws_flaskcicd"

*** Using a shell builtin with ansible command module - only the shell module has bash builtins.
** Not refactoring the plan often enough. As we go deeper into the project, we gain knowledge and experience. In the light of newfound knowledge, the old plan becomes obsolete and should be replaced with more refined new plan. It doesn't mean that I was stupid by making the wrong plan in the beginning. Acting incompetently is the only way to gain competence to start acting competently.
** Not reading up enough of previous documentation when coming back to project after a break. This led to duplicate work and thinking that the current task is more complicated than it was, in effect causing a longer delay in the project.
** Jenkins:
*** Tried to configure Jenkins the same way I once configured Icinga server in an automatic deployment - by dropping in configuration files from a preconfigured working server. Instead I should've looked for a more classic solution.
The right way to do it was through Jenkins CLI. I tried the drop in method to avoid learning how to use JCasC. If the plugin installation was that straightforward, I coul've finished the project without learning how to configure Jenkins with CLI (with the JCasC updating itself and installing other plugins from IaC).

* Extras:
** DONE Following a Jenkins Tutorial to learn how to make pipelines based on Jenkinsfiles
CLOSED: [2024-06-17 Mon 15:09]
*** DONE Set the goal: Jenkinsfile building my docker image and hosting it on ECS Fargate
CLOSED: [2023-09-20 Wed 11:05]
*** DONE Starting with tutorial titled "How to Use Jenkins to Build and Run an Image Using Docker"
CLOSED: [2023-09-20 Wed 18:58]

*** DONE Preparing the Jenkins Controller Instance to also server as a Docker building agent (manually for now, but later need to modify the ansible and eventually JCasC configuration):
CLOSED: [2023-09-20 Wed 14:06]
**** Suggested requirements to run docker:
***** Docker Engine: This is the core component required to build Docker images. You don't need to run containers, but the Docker engine must be installed to execute the docker build command.

***** Docker CLI: This is typically bundled with the Docker Engine installation. It provides the command-line interface to interact with Docker, including building images.

***** Jenkins Docker Plugin (optional): While not strictly necessary if you're using shell commands in Jenkins to build images, the Docker plugin can provide better integration and additional features for Docker within Jenkins.

***** Appropriate Permissions: The user under which Jenkins is running needs to have permissions to interact with the Docker daemon. This is often achieved by adding the Jenkins user to the docker group.
**** Summary: steps taken:
***** Install CentOS docker repo:
$ sudo dnf config-manager --add-repo https://download.docker.com/linux/centos/docker-ce.repo
***** Remove conflicting packages preinstalled on AlmaLinux
sudo dnf remove podman buildah -y
***** Install docker packages
sudo dnf install docker-ce docker-ce-cli containerd.io
***** Start docker service
sudo systemctl enable --now docker.service
***** Add jenkins (and vagrant) users to docker group
sudo usermod -aG docker jenkins
***** Install git package
***** Restart Jenkins service after changing the group.

**** Summary: How do I need to modify my Ansible playbook?

Install repo: https://download.docker.com/linux/centos/docker-ce.repo

Remove packages:
podman
buildah

Install packages:
bash-completion (for debugging and usability)
docker-ce docker-ce-cli containerd.io
git

Add jenkins user to docker group
!! jenkins service shouldn't be started before jenkins is added to the
docker group !!

Start and enable the docker.service


*** Writing the Jenkinsfile:
Shamelessly copying the example from the YouTube video.
*** Fixing agent to 'any' to allow building on the Jenkins controller
*** Installing git
