project_plan/flask-ci-cd-plan.md


<a id="orgf47e214"></a>

### DONE Create a project's README

Generated an initial version with ChatGPT. Will go over it a few times
to adjust it better to the project.

1.  DONE Finished refactoring the README

    Thanks to that amazing template the project is now very well described
    inside the README.

2.  Link to this README from python-flask-cidcd-code's README's

    We want somebody accidentally opening the code repo first to easily
    find the main README. This way the README in the code repo can remain
    simple.


<a id="orgf32c330"></a>

### TODO Quick-fix - manually generate a .html and link it in README


<a id="org5acb2f4"></a>

### TODO Find a way to export .org to .html headlessly


<a id="org9289337"></a>

### Decide where exactly to attach the hook


<a id="org5baadfd"></a>

### Add the hook


<a id="org81f6435"></a>

### Add links to auto-generated .html files in the project README


<a id="org7639dad"></a>

### Think of edge cases, tidy things up


<a id="orgc9c3d8d"></a>

# Mistakes:


<a id="orgd6ca99e"></a>

## Terraform:


<a id="org8aefc44"></a>

### Encapsulated a variable reference in double quotes, making it a literal string (effectively) turning off the reference mechanism.

    provider "aws" {
      region = var.aws_region # Correct
      # region = "var.aws_region" # Incorrect
    }


<a id="org3f5928d"></a>

## Using 'firewall-cmd' command without the '&#x2013;permanent' option

It doesn't work.


<a id="org20185f7"></a>

## Ansible


<a id="org00a308e"></a>

### Defining variables for a group in Ansible's hosts.ini outside [GROUPNAME:vars] subsection (forgetting the ':vars' modificator)

I used just the [GROUPNAME], instead of this:
[aws:vars]
\#ansible<sub>user</sub>=ec2-user
ansible<sub>user</sub>=vagrant
ansible<sub>ssh</sub><sub>private</sub><sub>key</sub><sub>file</sub>="../vault/id<sub>25519</sub><sub>aws</sub><sub>flaskcicd</sub>"


<a id="org53ba485"></a>

### Using a shell builtin with ansible command module - only the shell module has bash builtins.


<a id="orga0fe576"></a>

## Not refactoring the plan often enough. As we go deeper into the project, we gain knowledge and experience. In the light of newfound knowledge, the old plan becomes obsolete and should be replaced with more refined new plan. It doesn't mean that I was stupid by making the wrong plan in the beginning. Acting incompetently is the only way to gain competence to start acting competently.


<a id="org8ea0ad9"></a>

## Not reading up enough of previous documentation when coming back to project after a break. This led to duplicate work and thinking that the current task is more complicated than it was, in effect causing a longer delay in the project.


<a id="orgd933dec"></a>

## Jenkins:


<a id="org842997a"></a>

### Tried to configure Jenkins the same way I once configured Icinga server in an automatic deployment - by dropping in configuration files from a preconfigured working server. Instead I should've looked for a more classic solution.

The right way to do it was trough Jenkins CLI. I tried the drop in method to avoid learning how to use JCasC. If the plugin installation was that straightforward, I coul've finished the project without learning how to configure Jenkins with CLI (with the JCasC updating itself and installing other plugins from IaC).


<a id="org6f1b48c"></a>

# Extras:


<a id="orgda26a3c"></a>

## DONE Following a Jenkins Tutorial to learn how to make pipelines based on Jenkinsfiles


<a id="org94ecdc4"></a>

### DONE Set the goal: Jenkinsfile building my docker image and hosting it on ECS Fargate


<a id="orgf7b1c45"></a>

### DONE Starting with tutorial titled "How to Use Jenkins to Build and Run an Image Using Docker"


<a id="org5437860"></a>

### DONE Preparing the Jenkins Controller Instance to also server as a Docker building agent (manually for now, but later need to modify the ansible and eventually JCasC configuration):

1.  Suggested requirements to run docker:

    1.  Docker Engine: This is the core component required to build Docker images. You don't need to run containers, but the Docker engine must be installed to execute the docker build command.
    
    2.  Docker CLI: This is typically bundled with the Docker Engine installation. It provides the command-line interface to interact with Docker, including building images.
    
    3.  Jenkins Docker Plugin (optional): While not strictly necessary if you're using shell commands in Jenkins to build images, the Docker plugin can provide better integration and additional features for Docker within Jenkins.
    
    4.  Appropriate Permissions: The user under which Jenkins is running needs to have permissions to interact with the Docker daemon. This is often achieved by adding the Jenkins user to the docker group.

2.  Summary: steps taken:

    1.  Install CentOS docker repo:
    
        $ sudo dnf config-manager &#x2013;add-repo <https://download.docker.com/linux/centos/docker-ce.repo>
    
    2.  Remove conflicting packages preinstalled on AlmaLinux
    
        sudo dnf remove podman buildah -y
    
    3.  Install docker packages
    
        sudo dnf install docker-ce docker-ce-cli containerd.io
    
    4.  Start docker service
    
        sudo systemctl enable &#x2013;now docker.service
    
    5.  Add jenkins (and vagrant) users to docker group
    
        sudo usermod -aG docker jenkins
    
    6.  Install git package
    
    7.  Restart Jenkins service after changing the group.

3.  Summary: How do I need to modify my Ansible playbook?

    Install repo: <https://download.docker.com/linux/centos/docker-ce.repo>
    
    Remove packages:
    podman
    buildah
    
    Install packages:
    bash-completion (for debugging and usability)
    docker-ce docker-ce-cli containerd.io
    git
    
    Add jenkins user to docker group
    !! jenkins service shouldn't be started before jenkins is added to the
    docker group !!
    
    Start and enable the docker.service


<a id="org024dd35"></a>

### Writing the Jenkinsfile:

Shamelessly copying the example from the YouTube video.


<a id="org87d9b51"></a>

### Fixing agent to 'any' to allow building on the Jenkins controller


<a id="org8a16c6c"></a>

### Installing git

